"""""
SWOT-анализ — метод стратегического планирования, заключающийся в выявлении факторов внутренней и 
внешней среды организации и разделении их на четыре категории:

    Strengths (сильные стороны),
    Weaknesses (слабые стороны),
    Opportunities (возможности),
    Threats (угрозы).

"""""

class MethodSWOT():
    def __init__(self):
        ...

    def get_advs(self):
        #Считывает преимущества
        advs = input("Перечислите преимущества: ")
        ...

    def get_disadvs(self):
        #Считывает недостатки
        disadvs = input("Перечислите недостатки: ")
        ...

    def get_opports(self):
        #Считывает возможности
        opports = input("Перечислите возможности: ")
        ...

    def get_threats(self):
        #Считывает угрозы
        threats = input("Перечислите возможные угрозы: ")
        ...
